app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
---
    public function index()
    {
        $data['suppliers'] = $this->model->findAll();